# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.

import os

def listdir():
    print(os.listdir())